In [2]:
import pandas as pd

obj = pd.Series([10, 20, 30, 40])
print(obj)
print(obj.values)
print(obj.index)
print(type(obj))
print(obj.index, obj.values, sep='\n')
print(obj[0], obj[1], obj[[2,3]], sep='\n\n')
print(obj[1:3])

0    10
1    20
2    30
3    40
dtype: int64
[10 20 30 40]
RangeIndex(start=0, stop=4, step=1)
<class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=4, step=1)
[10 20 30 40]
10

20

2    30
3    40
dtype: int64
1    20
2    30
dtype: int64

In [10]:
obj = pd.Series([10,20,30,40],index = ['Label1','Label2','Label3','Label4'])
obj1 = pd.Series([100,200,300,400],index = ['Label2','Label3','Label4','Label5'])
print(obj + obj1)
print(obj1 - obj)
print(obj['Label2':'Label3'])

Label1      NaN
Label2    120.0
Label3    230.0
Label4    340.0
Label5      NaN
dtype: float64
Label1      NaN
Label2     80.0
Label3    170.0
Label4    260.0
Label5      NaN
dtype: float64
Label2    20
Label3    30
dtype: int64

In [15]:
dict = {'a':10,'b':20,'c':30,'d':40}
obj3 = pd.Series(dict)
print(obj3)
index = ['d','c','b','a','e']
obj4 = pd.Series(dict,index=index)
print(obj4)
#obj4['e'] = 50
print(obj4.isnull())
print(obj4.notnull())

a    10
b    20
c    30
d    40
dtype: int64
d    40.0
c    30.0
b    20.0
a    10.0
e     NaN
dtype: float64
d    False
c    False
b    False
a    False
e     True
dtype: bool
d     True
c     True
b     True
a     True
e    False
dtype: bool

In [22]:
print(obj4.name)
obj4.name = 'ObjectName'
print(obj4.name)

obj4.index = ['Label1','Label2','Label3','Label4','Label5']
obj4.index.name = 'IndexName'
obj4

ObjectName
ObjectName

IndexName
Label1    40.0
Label2    30.0
Label3    20.0
Label4    10.0
Label5     NaN
Name: ObjectName, dtype: float64

In [ ]:
info = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'name': ['John', 'Mike', 'Sara', 'Anna', 'Tom']}

df = pd.DataFrame(info, columns=['year', 'state', 'name', 'NewCol'])
df

   year   state  name NewCol
0  2000    Ohio  John    NaN
1  2001    Ohio  Mike    NaN
2  2002    Ohio  Sara    NaN
3  2001  Nevada  Anna    NaN
4  2002  Nevada   Tom    NaN

In [38]:
df['NewCol'] = [50,60,70,80,90]
rowindex = ['one','two','three','four','five']
df = pd.DataFrame(info, columns=['year', 'state', 'name', 'NewCol'], index=rowindex)
df['YearValue'] = df.year > 2001
del df['NewCol']
df

       year   state  name  YearValue
one    2000    Ohio  John      False
two    2001    Ohio  Mike      False
three  2002    Ohio  Sara       True
four   2001  Nevada  Anna      False
five   2002  Nevada   Tom       True